<script setup lang="ts">
</script>

<template>
  <div>
    <v-container class="text-white">
      <v-card-title>Правила судоку:</v-card-title>
      <v-card-text>
        <div class="text-subtitle-2 font-weight-black mb-2">Используйте цифры от 1 до 9</div>
        <div class="text-subtitle-1">
          Судоку играется на игровом поле, состоящем из 9 на 9 клеток, всего 81 клетка. Внутри игрового поля находятся 9 "квадратов" (состоящих из 3 x 3 клеток). Каждая горизонтальная строка, вертикальный столбец и квадрат (9 клеток каждый) должны заполняться цифрами 1-9, не повторяя никаких чисел в строке, столбце или квадрате. Это звучит сложно? Как видно из изображения выше, каждое игровое поле Судоку имеет несколько клеток, которые уже заполнены. Чем больше клеточек изначально заполнено, тем легче игра. Чем меньше клеток изначально заполнено, тем труднее игра. 
        </div>
      </v-card-text>
    </v-container>
  </div>
</template>

<style scoped lang="scss">
</style>